//------------------------------------------------------------------------------------------------------------------
//                                                   Задача 67                                     
//   Программа примает на вход число N и возвращает сумму цифр в числе
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------
Console.Clear();
int num = ReadInt("Введите N: ");
System.Console.WriteLine($"Сумма всех цифр в числе {num} равна {SumDigitRec(num)}.");

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------
// Ввод целого числа с клавиатуры.
int ReadInt(string msg)
{
    Console.Write(msg);
    return int.Parse(Console.ReadLine() ?? "0");
}

// Рекурентный метод поиска суммы цифр в числе
int SumDigitRec(int num)
{
    if (num == 0) { return 0; }
    else { return num % 10 + SumDigitRec(num / 10); }
}