//------------------------------------------------------------------------------------------------------------------
//                                                   Задача 69                                     
//   Напишите прграмму, которая будет принимать 2 числа А и В. Возыедите А в степень В с помощью рекурсии.
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------
Console.Clear();

int num = ReadInt("Введите число: ");
int exp = ReadInt("Введите степень: ");
Console.WriteLine($"Число {num} в степени {exp} = {MyPow(num, exp)}");

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------
// Ввод целого числа с клавиатуры.
int ReadInt(string msg)
{
    Console.Write(msg);
    return int.Parse(Console.ReadLine() ?? "0");
}

// Вычисление степени рекурентным способом
long MyPow(int a, int b)
{
    if (b == 2) return a * a;
    if (b == 1) return a;

    if (b % 2 == 0) 
        { return MyPow(a, b / 2) * MyPow(a, b / 2); }
    else 
        { return MyPow(a, b / 2) * MyPow(a, b / 2 + 1); }
}