//------------------------------------------------------------------------------------------------------------------
//                                                   Задача 64                                     
//                                          Домашнее задание к семинару 09
// Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. 
// Выполнить с помощью рекурсии.
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------
Console.Clear();

// Ввод параметра.
int num = ReadInt("Введите значение N: ");

// Вывод результата.
Console.WriteLine($"Натуральные числа от {num} до 1:");
PrintNaturalNumbersRec(num);

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------
// Ввод целого числа с клавиатуры.
int ReadInt(string msg)
{
    Console.Write(msg);
    return int.Parse(Console.ReadLine() ?? "0");
}

// Рекуррентный метод печати натуральных чисел от N до 1.
void PrintNaturalNumbersRec(int num)
{
    Console.Write(num + " ");
    if (num > 1) { PrintNaturalNumbersRec(num - 1); }
}
