//------------------------------------------------------------------------------------------------------------------
//                                                  Задача 22
//   Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов чисел от 1 до N.
//------------------------------------------------------------------------------------------------------------------


//------------------------------------------------------------------------------------------------------------------
//                                                  Методы
//------------------------------------------------------------------------------------------------------------------

//Ввод данных
int ReadData(string msg)
{
    Console.WriteLine(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

// Получение строки
string BuildLine(int num, int pow)
{
    string res = string.Empty;
    for (int i = 1; i <= num; i++) { res = res + Math.Pow(i, pow) + " ";}
    return res;
}

//Вывод данных
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}

//------------------------------------------------------------------------------------------------------------------
//                                               Тело программы
//------------------------------------------------------------------------------------------------------------------
Console.Clear(); // Очистка терминала
int number = ReadData("Введите положительное число N");
string sourceString = BuildLine(number,1);
string resultString = BuildLine(number,2);
PrintResult(sourceString + "-> " + resultString);

