//------------------------------------------------------------------------------------------------------------------
//                                                  Задача 28
//    Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
//------------------------------------------------------------------------------------------------------------------
using System.Numerics;

//------------------------------------------------------------------------------------------------------------------
//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------
Console.Clear();
int number = ReadData("Введите целое число: ");
BigInteger fact = Factorial(number);
PrintResult($"Факториал числа {number} равен {fact}");

//------------------------------------------------------------------------------------------------------------------
//                                                    Методы
//------------------------------------------------------------------------------------------------------------------

// Ввод данных с клавиатуры
int ReadData(string msg)
{
    Console.Write(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

// Вывод результата
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}

// Вычисление факториала
BigInteger Factorial(int number)
{
    BigInteger result = 1;
    for (int i = 2; i <= number; i++) { result *= i; }
    return result;
}