//------------------------------------------------------------------------------------------------------------------
//                                                  Задача 14
//  Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
//------------------------------------------------------------------------------------------------------------------

Console.Clear(); // Очистка терминала

// Ввод данных
Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine() ?? "0");

// Проверка условия
Console.WriteLine ((number%7==0 && number%23==0)? "Кратно" : "Не кратно");