//------------------------------------------------------------------------------------------------------------------
//                                                   Задача 61                                     
//   Вывести первые N строк треугольника Паскаля. Сделать вывод в виде равнобедренного треугольника
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------
Console.Clear();

// Ввод N.
int countRow = ReadInt("Задайте количество строк треугольника Паскаля (N): ");

// Вывод треугольника Паскаля первые N строк.
PrintPascalTriangle(countRow);

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------
int ReadInt(string msg)
{
    Console.Write(msg);
    return int.Parse(Console.ReadLine() ?? "0");
}

//n!/k!*(n-k)!
long Factoreal(int n)
{
    long res = 1;
    for (int i = 1; i <= n; i++)
    {
        res = res * i;
    }
    return res;
}

//           1
//          1 1
//         1 2 1
//        1 3 3 1
void PrintPascalTriangle(int nRow)
{
    for (int i = 0; i < nRow; i++)
    {
        for (int k = 0; k < nRow - i; k++)
        {
            Console.Write(" ");
        }

        for (int j = 0; j <= i; j++)
        {
            Console.Write(" ");
            Console.Write(Factoreal(i) / (Factoreal(j) * Factoreal(i - j)));
        }
        Console.WriteLine();
    }
}