//------------------------------------------------------------------------------------------------------------------
//                                                   Задача 65                                     
//   Задайте значения M и N. Напишите программу, которая найдёт все натуральные элементы в промежутке от M до N.
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------
Console.Clear();

// Ввод данных.
int m = ReadInt("Введите M: ");
int n = ReadInt("Введите N: ");

// Печать строки.
Console.WriteLine((m > n)
                  ? SearchForNaturalElementsRec(n, m)
                  : SearchForNaturalElementsRec(m, n));

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------
// Ввод целого числа с клавиатуры.
int ReadInt(string msg)
{
    Console.Write(msg);
    return int.Parse(Console.ReadLine() ?? "0");
}

// Рекурентный метод печати натуральных чисел  от N до M
string SearchForNaturalElementsRec(int m, int n)
{
    return n >= m
    ? $"{m} " + SearchForNaturalElementsRec(m + 1, n)
    : "";
}