//------------------------------------------------------------------------------------------------------------------
//                                                  Задача 30
//    Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
//------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------
//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------
Console.Clear();
int number = ReadData("Введите целое число: ");
int[] array = GenArray(number);
PrintArray(array);

//------------------------------------------------------------------------------------------------------------------
//                                                    Методы
//------------------------------------------------------------------------------------------------------------------

// Ввод данных с клавиатуры
int ReadData(string msg)
{
    Console.Write(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

// Генерация массива
int[] GenArray(int len)
{
    int[] array = new int[len];
    Random rnd = new Random();
    for (int i = 0; i < len; i++) { array[i] = rnd.Next(0, 2); }
    return array;
}

// Вывод массива
void PrintArray(int[] array)
{
    Console.Write("[");
    for (int i = 0; i < array.Length - 1; i++) { Console.Write(array[i] + ", "); }
    Console.WriteLine(array[array.Length - 1] + "]");
}
