//------------------------------------------------------------------------------------------------------------------
//                                                  Задача 11
//  Напишите программу, которая выводит случайное трёхзначное число и удаляет вторую цифру этого числа.
//------------------------------------------------------------------------------------------------------------------

Console.Clear(); // Очистка терминала

// Задаем число
int num = new Random().Next(100, 1000);
Console.Write(num +" -> ");
int firstDigit = num/100;
int lastDigit = num%10;

// Выводим результат преобразования
num = firstDigit*10+lastDigit;
Console.WriteLine(num);
