//------------------------------------------------------------------------------------------------------------------
//                                                  Задача 24
//    Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
//------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------
//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------

Console.Clear();
int numberA = ReadData("Введите целое число A: ");

// Простой метод
DateTime d1 = DateTime.Now;
int result1 = SimpleSum(numberA);
Console.WriteLine(DateTime.Now - d1);

// Аналитический метод
DateTime d2 = DateTime.Now;
int result2 = GausseSum(numberA);
Console.WriteLine(DateTime.Now - d2);

PrintResult("(Простой) Сумма чисел от 1 до "+ numberA + " = " + result1);
PrintResult("(Гаусс) Сумма чисел от 1 до "+ numberA + " = " + result2);

//------------------------------------------------------------------------------------------------------------------
//                                                    Методы
//------------------------------------------------------------------------------------------------------------------

// Ввод данных с клавиатуры
int ReadData(string msg)
{
    Console.WriteLine(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

// Вывод результата
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}

// Подсчет суммы от 1 до А.
int SimpleSum (int numA)
{   
    int sumOfNumber = 1;
    for (int i=2; i<=numA; i++)
    {
        sumOfNumber+=i;
    }

    return sumOfNumber;
}

// Подсчет суммы от 1 до А по Гауссу
int GausseSum(int numA)
{
    int sumOfNumber = (numA*(numA+1))/2;
    return sumOfNumber;
}